
## Plan Result

[CI link](https://github.com/malachowski-labs/infrastructure/actions/runs/21760094013)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * helm_release.external_secrets


<details><summary>Change Result (Click me)</summary>

```hcl

  # helm_release.external_secrets will be updated in-place
  ~ resource "helm_release" "external_secrets" {
      ~ id                         = "external-secrets" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.3.1" -> (known after apply)
          ~ chart          = "external-secrets" -> (known after apply)
          ~ first_deployed = 1770318456 -> (known after apply)
          ~ last_deployed  = 1770318456 -> (known after apply)
          ~ name           = "external-secrets" -> (known after apply)
          ~ namespace      = "external-secrets" -> (known after apply)
          ~ notes          = <<-EOT
                external-secrets has been deployed successfully in namespace external-secrets!
                
                In order to begin using ExternalSecrets, you will need to set up a SecretStore
                or ClusterSecretStore resource (for example, by creating a 'vault' SecretStore).
                
                More information on the different types of SecretStores and how to configure them
                can be found in our Github: https://github.com/external-secrets/external-secrets
            EOT -> (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - installCRDs    = true
                  - serviceAccount = {
                      - create = false
                      - name   = "external-secrets-operator"
                    }
                }
            ) -> (known after apply)
          ~ version        = "1.3.1" -> (known after apply)
        } -> (known after apply)
        name                       = "external-secrets"
      ~ version                    = "1.3.1" -> "2.0.0"
        # (28 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"infra-plan","PRNumber":17,"Program":"tfcmt","SHA1":"57190fd4ce767607d48a17aa2560ade10ca56fa3","Vars":{},"WorkflowName":"infra-plan"} -->